app/controllers/tweets_controller.rb

  def index
      @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)

  def create
      Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `image`, `text`, `created_at`, `updated_at`) VALUES ('sunafukin', 'https://media-cdn.tripadvisor.com/media/photo-s/0d/5d/4a/f3/salle-de-restaurant.jpg', '素晴らしい！', '2018-09-13 03:58:41', '2018-09-13 03:58:41')

  def destroy
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.destroy
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 6 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 6

  def update
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.update(tweet_params)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
UPDATE `tweets` SET `image` = 'https://media-cdn.tripadvisor.com/media/photo-s/13/af/09/e1/exterior.jpg', `text` = 'なんやこれ！', `updated_at` = '2018-09-14 10:12:06' WHERE `tweets`.`id` = 12

  def show
    @tweet = Tweet.find(params[:id])
    @comments = @tweet.comments.includes(:user)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 7